Table of Contents
 Class IdeaSectionResult
Namespace
IdeaStatiCa.BimApiLink.Results.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaSectionResult : IIdeaSectionResult
Inheritance
object
IdeaSectionResult
Implements
IIdeaSectionResult
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaSectionResult(IIdeaLoading, InternalForcesData)
public IdeaSectionResult(IIdeaLoading loading, InternalForcesData data)
Parameters
loading IIdeaLoading
data InternalForcesData
Properties
 Data
Data for the result.
public IIdeaResultData Data { get; }
Property Value
IIdeaResultData
 Loading
Loading source of the result.
public IIdeaLoading Loading { get; }
Property Value
IIdeaLoading
 Edit this page